[
    {
        "_id": "642ea2d2e64f9f85571b3248",
        "title": "Rice with vegetables",
        "category": "Starters",
        "imageUrl": "https://www.supichka.com/files/images/2311/fit_1400_933.jpg",
        "ingredients": [
            "rice: 2 tea cups",
            "carrots: 3 pieces",
            "onion: 1 piece",
            "pepper/pepper: 1 piece",
            "mushrooms: 10 pieces",
            "corn: 1/2 tea cup",
            "peas: 1/2 tea cup",
            "parsley: 1/2 connection",
            "pepper: 1/2 tsp"
        ],
        "preparation": "The first step of the recipe for rice with vegetables in the oven is the selection and preparation of the products. It is best to use as many fresh vegetables as possible and refrain from frozen and pre-processed ones. Finely chop the onion, clean and cut the carrots, pepper and mushrooms. In a deep frying pan, heat ½ teaspoon of oil and pour in the carrots, onions, mushrooms, pepper and washed rice. Stir until the rice is fried and becomes transparent.\\nAdd the corn and peas, canned or frozen, to the mixture, add 1 teaspoon of salt and black pepper, mix. Pour the mixture into a pan, add 5 tea cups of water and place in a preheated oven at 180 degrees until the water boils completely and the rice is fully cooked.\\n\\nBefore serving, sprinkle the rice with vegetables with finely chopped parsley.\\n\\nThe recipe for rice with vegetables in the oven is complete.",
        "_ownerId": "642ea122e64f9f85571b31f8",
        "__v": 0
    },
    {
        "_id": "642ea38de64f9f85571b3273",
        "title": "Macaroni",
        "category": "Starters",
        "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS5ksPpUqb3ZFSl3fVeGLsEayyi37Rhe2K02g&usqp=CAU",
        "ingredients": [
            "pasta - 1 package",
            "oil - 50 ml /or cow butter/",
            "cheese - 100 g",
            "salt - 1 tbsp.",
            "cheese - optional",
            "sugar - as desired",
            "water"
        ],
        "preparation": "Boil the macaroni in the water, adding 1 tbsp of salt.\\n\\nBoil for 8 to 10 minutes, adding 50 ml of cold water twice to the boiling macaroni.\\n\\nThis is done so that the macaroni does not become sticky. After they are cooked, drain the water and put them in a colander , gently rinsing them with cold water to remove the starch.\\n\\nCrumble the cheese and mix again.\\n\\nThe oil is heated and when it is hot, it is poured into the finished macaroni.\\n\\nIf the chef wishes, cheese can be grated and melted by the heat. If you like a sweet and salty taste, you can add sugar to the macaroni and cheese.",
        "_ownerId": "642ea122e64f9f85571b31f8",
        "__v": 0
    },
    {
        "_id": "642ea431e64f9f85571b3281",
        "title": "Spinach and cheese puffs",
        "category": "Main dish",
        "imageUrl": "https://i.pinimg.com/736x/97/90/03/9790032e1e634f74dae167eb3dd8d118.jpg",
        "ingredients": [
            "275 g unfrozen puff pastry",
            "500 g of baby spinach",
            "2 eggs",
            "200 g of cheese",
            "2 cloves of green garlic",
            "4 sprigs of green onion",
            " 3-4 tablespoon of breadcrumbs",
            "2 tbsp oil",
            "1 teaspoon of black pepper",
            "1 tablespoon chopped dill",
            "pinch of salt",
            "sour cream for garnish"
        ],
        "preparation": "Spinach is cleaned, washed and dried well. Green onions and garlic are cleaned and the white part is separated from the green part. The white part of the onion and garlic is cut into rings and stewed until softened in the oil, together with the spinach. Add the eggs, crumbled cheese and a pinch of salt to the spinach mixture. Mix well. Finely chop the green part of the onion and garlic and add to the spinach mixture together with the dill/parsley. The mixture is compacted so that there is no liquid with 3 - 4 tablespoons of breadcrumbs. The puff pastry is first cut into 15x15 cm squares, then the squares are also cut diagonally into triangles. Spread the spinach mixture evenly down the middle of each triangle. The sharp ends of the triangle are transferred one above the other on the stuffing to the opposite side. The pieces obtained in this way are baked in a heated oven at 200C until they turn red. They are served with sour cream or condensed milk.",
        "_ownerId": "642ea122e64f9f85571b31f8",
        "__v": 0
    },
    {
        "_id": "642ea5a3e64f9f85571b329c",
        "title": "Grilled vegetables",
        "category": "Starters",
        "imageUrl": "https://rec-origin-graphics.s3.amazonaws.com/0_GraphicsRecipes/6463_400.jpg",
        "ingredients": [
            "eggplants",
            "Zucchini",
            "carrots",
            "fresh peppers",
            "old onion",
            "a few cloves of garlic",
            "uice per 1 pc. lemon",
            "olive oil",
            "soy sauce",
            "salt",
            "1 bunch of dill"
        ],
        "preparation": "The type and amount of vegetables are optional, in this case I used 2 pcs. eggplants, 4 small zucchini and 3 medium carrots.\\n\\nThe vegetables are cut lengthwise into thin strips, salted and left in a colander or in an inclined pan to drain the water (especially the eggplant, otherwise it can be bitter). Then they are poured with lemon juice, soy sauce, olive oil and garlic as desired.\\nAfter they have stood for about 30 minutes, they are grilled or grilled and placed in a container with a lid.\\nThey can be eaten straight or seasoned on a salad with a little more salt, lemon juice, olive oil and dill.\\n\\nAn ideal side dish for meat, chicken or fish.",
        "_ownerId": "642ea159e64f9f85571b3201",
        "__v": 0
    },
    {
        "_id": "642ea5e7e64f9f85571b32a0",
        "title": "Backed patatoes",
        "category": "Side dish",
        "imageUrl": "https://1.bp.blogspot.com/-Mg1v660F54c/X5fahV5z9CI/AAAAAAADFCQ/-4ORH_cZGIYbBZ_wbya0U2AyHbGbLUIYQCLcBGAsYHQ/s2048/IMG_7439.JPG",
        "ingredients": [
            "3 pcs. potatoes",
            "1 tbsp. paprika",
            "salt",
            "2-3 tbsp. olive oil"
        ],
        "preparation": "Potatoes are peeled and cut into sticks. Season with salt and red pepper, sprinkle with olive oil and mix well with your hands. They are spread out in a tray with baking paper on the bottom. Bake in a heated oven at 180 C with a fan, on the middle grill, for about 20 minutes.\\nOther spices of choice can be added.",
        "_ownerId": "642ea159e64f9f85571b3201",
        "__v": 0
    },
    {
        "_id": "642ea6a3e64f9f85571b32a4",
        "title": "Tender lamb in the oven",
        "category": "Main dish",
        "imageUrl": "https://flawlessfood.co.uk/wp-content/uploads/2020/04/blog-200421-Slow-Cooked-Leg-of-Lamb-19205.jpg",
        "ingredients": [
            "goat meat - 400 g",
            "potatoes - 2 - 3 pcs. large",
            "carrot - 1 pc. big",
            "red beet - 1/2 small head",
            "oil",
            "paprika",
            "pepper",
            "salt",
            "thyme",
            "red wine - 1 tsp.",
            "Savory - optional"
        ],
        "preparation": "We thoroughly clean the kid from fat and skins, if necessary, debone. Cut into suitable pieces and rub a little salt into the meat, let it rest for 15-20 minutes. Heat a pan (teflon) with a little oil and seal the meat on all sides. We clean the carrots, beets and potatoes and cut them into larger pieces. Arrange the meat in a greased pan, around it - the chopped vegetables. Pour oil on top and sprinkle with spices - salt, black pepper, red pepper. If you have fresh thyme , put one stalk, if not - use dried, a few pinches. I also added a pinch of savory - a matter of taste. Pour in the red wine, you will probably need to add a little water to cover the vegetables.",
        "_ownerId": "642ea159e64f9f85571b3201",
        "__v": 0
    },
    {
        "_id": "642ea6f0e64f9f85571b32a8",
        "title": "Lamb in casserole",
        "category": "Main dish",
        "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTUUQ1tLBCsIlxtVAA71V8aiFRqA2ghBWUpKA&usqp=CAU",
        "ingredients": [
            "lamb meat - 1.5 kg",
            "fresh onion - 3 links",
            "jojen - 2 link fresh",
            "lemon juice - from 1 pc.",
            "oil - 60 g",
            "thyme",
            "rosemary",
            "sage",
            "turmeric",
            "garlic powder",
            "pepper",
            "oil - 3 tbsp",
            "red pepper - 2 tbsp.",
            "potatoes - 2 - 3 pcs.",
            "salt"
        ],
        "preparation": "Pour the lemon juice, olive oil, red pepper, thyme, sage , rosemary, salt and black pepper into a deep bowl. We mix all this well. We have pre-washed the lamb meat and dried it. We smear each portion with the mixture of spices and leave it to age overnight in the refrigerator. Finely chop the fresh onion and garlic and place in a casserole at the bottom. Place the seasoned lamb on top of them. Put pieces of butter on top, pour 2 tsp. hot water and close with the lid. Place in a cold oven and bake in moderate for 1 hour. Remove the portions from the oven. Place the sliced ​​potatoes and the meat on top and place in the oven. Sprinkle the potatoes with savory and let them bake until done",
        "_ownerId": "642ea159e64f9f85571b3201",
        "__v": 0
    },
    {
        "_id": "642ea736e64f9f85571b32ac",
        "title": "Gluten-free carrot cake",
        "category": "Desert",
        "imageUrl": "https://gimmedelicious.com/wp-content/uploads/2020/11/Gluten-Free-Carrot-Cake-1.jpg",
        "ingredients": [
            "eggs - 3 pcs.",
            "brown sugar - 1 tsp muscovado",
            "vanilla - 1 tsp liquid",
            "yogurt - 1/2 tsp.",
            "ammonia soda - 1 p.",
            "oil - 1/2 tsp.",
            "nutmeg - 1/3 tsp.",
            "rice flour - 1 tsp.",
            "coconut flour - 1/2 tsp.",
            "walnuts - 100 g",
            "coconut shavings - 4 tbsp.",
            "carrots - 2 tsp grated"
        ],
        "preparation": "Peel and grate the carrots on a coarse grater . Chop the walnuts. Extinguish the soda in the yogurt. Beat the eggs with the sugar and vanilla. Gradually add all other ingredients, stirring after each addition. Finally, add the grated carrots and mix. Transfer the carrot cake mixture to a tray lined with baking paper and bake in a 170°C oven for 35 minutes - until a toothpick is dry. Cool the finished gluten-free cake on a wire rack and then cover with melted chocolate mixed with a spoonful of oil. If desired, sprinkle with some nuts. Delicious and aromatic gluten-free carrot cake with chocolate",
        "_ownerId": "642ea159e64f9f85571b3201",
        "__v": 0
    },
    {
        "_id": "642ea7f4e64f9f85571b32bc",
        "title": "Meatballs islam kebab",
        "category": "Main dish",
        "imageUrl": "https://cdn.shopify.com/s/files/1/0148/1945/9126/articles/Moroccan_Shashlik_Lamb_Kebabs_720x.jpg?v=1606153973",
        "ingredients": [
            "minced meat - 500 g beef lamb,",
            "eggplants - 2 longer ones",
            "cumin - 1 tsp",
            "black pepper - 1/2 tsp.",
            "parsley - 4 - 5 stalks",
            "garlic - 4 - 5 cloves",
            "salt on taste",
            "oil"
        ],
        "preparation": "Cut the eggplant lengthwise into thin strips, add salt and let it drain from the black water in a colander for about twenty minutes. Rinse, drain and grill, pre-greased with oil. Add salt, finely chopped onion, black pepper, parsley and cumin to the minced meat and mix well. It is good to leave the minced meat mixed with the other products for some time to get flavor. Place the baked eggplant slices in a cross and place the meatballs on them, wrap with the eggplant and stick with a toothpick. Place a cherry tomato on top and finish with a slice of pepper. Pour fat on top and around them, add salt and bake in the oven at 220 degrees.",
        "_ownerId": "642ea76ce64f9f85571b32b5",
        "__v": 0
    },
    {
        "_id": "642ea823e64f9f85571b32c0",
        "title": "Pepper burek",
        "category": "Starters",
        "imageUrl": "https://www.supichka.com/files/images/252/fit_1400_933.jpg",
        "ingredients": [
            "peppers 8 pieces",
            "eggs 4 pieces",
            "cheese 200 grams",
            "garlic 2 cloves",
            "parsley 1/4 connection",
            "flour 50 grams",
            "breadcrumbs 50 grams"
        ],
        "preparation": "The first step in the pepper burek recipe is to prepare the peppers. It is good that the peppers are pre-roasted and peeled, as well as completely cooled. Whether you roast the peppers on the stove, on the barbecue or on the grill is a matter of choice. It is good to choose medium-sized peppers, neither too small nor too big, because if they are too big, they will absorb a lot of stuffing. Allow the peeled and cleaned peppers to drain well. Beat 3 of the eggs, crumble the cheese, add the finely chopped garlic and parsley and mix well. Fill the prepared peppers with a teaspoon. Beat the last egg. Roll the stuffed peppers first in flour, then in beaten egg and finally in breadcrumbs.",
        "_ownerId": "642ea76ce64f9f85571b32b5",
        "__v": 0
    },
    {
        "_id": "642ea857e64f9f85571b32c4",
        "title": "German soup with leeks",
        "category": "Main dish",
        "imageUrl": "https://www.supichka.com/files/images/1122/fit_1400_933.jpg",
        "ingredients": [
            "minced meat 200 grams",
            "leek 3 stalks",
            "cream cheese 100 grams",
            "cheese 100 grams or Emmental",
            "celery 10 leaves",
            "oil 2 tablespoons",
            "melted cheese 100 grams",
            "cooking cream 1/2 tea cup"
        ],
        "preparation": "The first step in the recipe for German leek mince soup is to fry the leeks and mince. Clean the leek and cut it into rings. In the pot in which you will cook the soup, heat the oil and add the chopped leek, stir well for 3-4 minutes, then add the minced meat. Stir constantly so that the minced meat does not remain in lumps. Pour 1 liter of water, add the cooking cream. Let the soup boil for 15-20 minutes. After about 20 minutes, add the grated hard cheeses and the cream cheese, stirring continuously until they are completely melted. Finally, add the finely chopped celery.",
        "_ownerId": "642ea76ce64f9f85571b32b5",
        "__v": 0
    },
    {
        "_id": "642ea892e64f9f85571b32c8",
        "title": "Double chocolate cake",
        "category": "Desert",
        "imageUrl": "https://www.supichka.com/files/images/3303/fit_1400_933.jpg",
        "ingredients": [
            "eggs 1 piece",
            "sugar 1 tea cup",
            "yoghurt 1 tea cup",
            "baking soda 1 teaspoon",
            "oil 1/2 tea cup",
            "chocolate 100 grams",
            "cocoa 4 tablespoons",
            "flour 2 tea cups",
            "chocolate 100 grams",
            "Coke 5 tablespoons",
            "butter 2 tablespoons"
        ],
        "preparation": "The first step of the double chocolate brownie recipe is to prepare the ingredients. You cut the chocolate into very small pieces or grind it using a blender. Sift the flour together with the cocoa. Using a mixer or wire whisk, beat the egg, along with the sugar, add the oil little by little. You mix the yogurt with the baking soda, then add it to the liquid mixture and beat again until you get a homogeneous mixture. Little by little, while stirring constantly, add the flour to the liquid mixture. Finally, add the chocolate, then mix well with a spoon or spatula. You grease a baking form with oil, pour the mixture and bake in a preheated oven at 170 degrees for about 30 minutes, until poking it with a toothpick it comes out dry. After baking, wait a few minutes and turn the cake over to cool completely.",
        "_ownerId": "642ea76ce64f9f85571b32b5",
        "__v": 0
    },
    {
        "_id": "642ea8bce64f9f85571b32cc",
        "title": "Pasta salad with chicken",
        "category": "Starters",
        "imageUrl": "https://www.supichka.com/files/images/3016/fit_1400_933.jpg",
        "ingredients": [
            "pasta 200 grams",
            "tomatoes 200 grams",
            "avocado 1 piece",
            "chicken 200 grams",
            "fresh onion 3 pieces",
            "olive oil 3 tablespoons",
            "balsamic vinegar 1 tablespoon"
        ],
        "preparation": "The first step in the Chicken Avocado Pasta Salad recipe is to prepare the chicken and pasta. Boil the pasta after pouring it into boiling salted water and cook according to the instructions on the package. Drain them from the water, cover with cold water and drain again, then pour them into a bowl, add a little olive oil and stir so they don't stick together. While you are cooking and preparing the pasta, you are also cooking the chicken. You can use any chicken meat - white meat, thighs. After the meat is cooked very well, you chop it into small pieces and add it to the pasta. Wash the onion and tomatoes and cut them into small pieces. You also cut the avocado into cubes and add them to the bowl with the pasta. Add about ½ teaspoon of salt as well as the intended amount of olive oil and balsamic vinegar and mix well with a spoon so that the salad tastes good.",
        "_ownerId": "642ea76ce64f9f85571b32b5",
        "__v": 0
    },
    {
        "_id": "642ea8e4e64f9f85571b32d0",
        "title": "Caprese Salad",
        "category": "Starters",
        "imageUrl": "https://www.supichka.com/files/images/1546/fit_1400_933.jpg",
        "ingredients": [
            "tomatoes 2 pieces",
            "mozzarella 2 pieces",
            "basil 15 leaves",
            "olive oil 2 tablespoons",
            "balsamic vinegar 1 tablespoon"
        ],
        "preparation": "Cut the tomatoes and mozzarella into rings and arrange them on a plate, putting one round of mozzarella cheese on top of each round of tomato. You can arrange them in a circle, overlapping the edges of each piece, or you can have them stand alone. After layering the tomatoes and mozzarella, it's time for the basil. If you use fresh basil , you can place one leaf on each piece of mozzarella, or cut it very finely and sprinkle it over the whole salad, as in the picture. If you use dried basil, just sprinkle it over the salad. Caprese salad becomes much tastier with fresh basil, because it gives much more freshness and is much more aromatic than dry basil. Unfortunately, fresh basil is almost \\undetectable\\ in most stores, only the big chains carry this spice fresh. Fresh basil is of course also available in the market.",
        "_ownerId": "642ea76ce64f9f85571b32b5",
        "__v": 0
    },
    {
        "_id": "642ea92ae64f9f85571b32ed",
        "title": "Green salad with salmon",
        "category": "Starters",
        "imageUrl": "https://www.supichka.com/files/images/126/fit_1400_933.jpg",
        "ingredients": [
            "lettuce 1 piece",
            "smoked salmon 50 grams",
            "beetroot 1 chapter",
            "a small head of boiled ",
            "olive oil 2 tbsp"
        ],
        "preparation": "The first step of the recipe for green salad with salmon and beetroot is to prepare the products. The beetroot must be boiled or baked in advance. Whichever option you choose, you won't go wrong, bearing in mind that boiling the beetroot takes at least an hour. Peel the beetroot and wash and dry the lettuce. Squeeze the juice from the orange and mix it with the olive oil, balsamic vinegar and ½ teaspoon of salt to make the salad dressing. Chop the washed and dried lettuce in a bowl. Cut the beetroot into thin slices and cut the fish into pieces. Add the dressing and toss gently, preferably with your hands, to keep the salad as fresh and fluffy as possible.",
        "_ownerId": "642ea122e64f9f85571b31f8",
        "__v": 0
    },
    {
        "_id": "642ea957e64f9f85571b32f1",
        "title": "English breakfast",
        "category": "Starters",
        "imageUrl": "https://www.supichka.com/files/images/2512/fit_1400_933.jpg",
        "ingredients": [
            "eggs 4 pieces",
            "sausage 2 pieces",
            "bacon 50 grams",
            "beans 200 grams",
            "cooked tomato 3 tbs.",
            "bread 4 slices",
            "pepper 1/4 tsp."
        ],
        "preparation": "The first step of the English breakfast recipe is the selection and preparation of the products. The bacon should be very thinly sliced, the beans may be canned or cooked by you and drained, or canned beans with tomato puree. Mix the beans with the tomato puree, add ½ teaspoon of salt and black pepper and mix. Heat a pan and fry the bacon until golden. Divide it into two plates, then add 1 tablespoon of oil to the pan and fry the sausages. After the sausages comes the turn of the eggs. You fry them in the same pan to the degree you want. Finally, fry the slices and divide all the ingredients into two portions. Serve the English breakfast with English black tea.",
        "_ownerId": "642ea122e64f9f85571b31f8",
        "__v": 0
    },
    {
        "_id": "642ea9d3e64f9f85571b3300",
        "title": "Chicken meatballs",
        "category": "Main dish",
        "imageUrl": "https://www.supichka.com/files/images/3281/fit_1400_933.jpg",
        "ingredients": [
            "chicken 500 grams",
            "eggs 1 piece",
            "breadcrumbs 1/2 tea cup",
            "parmesan 1/2 tea cup",
            "grated oil 2 tablespoons",
            "garlic 1 clove",
            "fresh onion 2 stalks",
            "salt 1/2 tsp",
            "pepper 1/3 tsp"
        ],
        "preparation": "The first step of the recipe for chicken meatballs in the oven is the selection and preparation of the chicken. You choose quality chilled Bulgarian chicken meat to guarantee a good result. Ludogor chicken meat is always a good idea. Chop the chicken finely, the easiest way to do this is in a food processor or chopper. Do not grind the meat, leave it in small pieces to get nicer meatballs. Pour the shredded chicken into a bowl. Add the salt, egg, grated parmesan cheese, oil, as well as breadcrumbs and black pepper. Finely chop the cleaned and washed onions, crush the garlic and add them to the mixture. You mix everything very well until you get a homogeneous dough. Place baking paper on a large tray. From the resulting mixture, form small meatballs of the desired size, which you arrange in the tray.",
        "_ownerId": "642ea159e64f9f85571b3201",
        "__v": 0
    },
    {
        "_id": "642eaa15e64f9f85571b3304",
        "title": "Chicken burger",
        "category": "Starters",
        "imageUrl": "https://www.supichka.com/files/images/3266/fit_1400_933.jpg",
        "ingredients": [
            "yoghurt 200 grams",
            "garlic 2 cloves",
            "chicken 300 grams",
            "white meat chicken",
            "fresh onion 1 stalk",
            "breadcrumbs 3 tablespoons",
            "eggs 1 piece",
            "thyme 1 teaspoon",
            "oil 1 tablespoon",
            "bread rolls 6 pieces",
            "tomatoes 1 piece",
            "cheese 6 slices",
            "lettuce"
        ],
        "preparation": "Mix together mince, onion, breadcrumbs, grated cheese and beaten egg. Season well. Using hands, shape into 4 patties. Heat oil in a large frying pan over medium heat. Cook patties for 3-4 mins, each side, until golden and cooked through. Top each pattie with a slice of cheese. Cook for 1 min, until cheese softens. Meanwhile, cook bacon and eggs in a non-stick frying pan over medium heat for 1-2 mins, until cooked to your liking.\nLay lettuce over the base of each bun. Top with chicken pattie, bacon, beetroot, tomato chutney and an egg. Serve with fries.",
        "_ownerId": "642ea159e64f9f85571b3201",
        "__v": 0
    },
    {
        "_id": "642eaa49e64f9f85571b3308",
        "title": "Oven- baked lamb",
        "category": "Main dish",
        "imageUrl": "https://www.supichka.com/files/images/407/fit_1400_933.jpg",
        "ingredients": [
            "goat meat 1 1/2 kg",
            "fresh onion 4 connections",
            "jojen 1 connection",
            "parsley 1 connection",
            "paprika 1 tablespoon",
            "pepper 1 teaspoon",
            "oil 1 coffee cup"
        ],
        "preparation": "The first step of the recipe for oven-roasted goat with onions is the preparation of the products. Wash the onion and spices and chop them finely. Wash the goat meat well, then brush it with oil and rub it with the spices and 1 teaspoon of salt. Pour the chopped onions and spices into a deep pan and add ½ teaspoon of salt. On top of the canapé of onions and spices, place the flavored kid meat, add 1 ½ tea cups of water and cover the pan well with aluminum foil. Bake the roast kid with onions in a preheated oven at 200 degrees for about two and a half hours, then remove the foil, reduce the oven at 180 degrees and bake for another 30 minutes so that the goat meat acquires an appetizing golden crust.",
        "_ownerId": "642ea159e64f9f85571b3201",
        "__v": 0
    },
    {
        "_id": "642eaa79e64f9f85571b330c",
        "title": "Oven-baked neck steaks",
        "category": "Main dish",
        "imageUrl": "https://i.ytimg.com/vi/sdXkoBv6ujQ/maxresdefault.jpg",
        "ingredients": [
            "pork - 4 - 5 neck steaks",
            "mushrooms - 400 g mushrooms 3-4",
            "lemons -  juice from 1 citrus",
            "white wine - 1 tsp.",
            "water - 1/2 tsp.",
            "oil - 60 ml",
            "pepper",
            "mashed potatoes - 2 tbsp. dry"
        ],
        "preparation": "Pound the neck steaks lightly. Squeeze lemon juice over them, salt and sprinkle with black pepper. You can also pour a little white wine. Cover and let marinate for 2 hours. Then transfer the pork to a greased tray, distribute the cleaned mushrooms between the meat, pour the water and wine, again a little salt and pepper. Cover the pan tightly with foil and put it in a moderate oven for 2 hours to stew. The sauce on the finished steaks is thickened with potato starch and served",
        "_ownerId": "642ea159e64f9f85571b3201",
        "__v": 0
    }
]